{"status":"ok","articles":[{"id":1,"author":"Полина Колесниченко","title":"Новая версия Bootstrap!!!","description":"Свободный набор инструментов для создания сайтов и веб-приложений. Включает в себя HTML- и CSS-шаблоны оформления для типографики, веб-форм, кнопок, меток, блоков навигации и прочих компонентов веб-интерфейса, включая JavaScript-расширения.","url":"https://pbs.twimg.com/media/DrAIAofW4AAeexc.jpg","urlToImage":"https://pbs.twimg.com/media/DrAIAofW4AAeexc.jpg","publishedAt":"07.04.2021, 19:10"},{"id":4,"author":"МБХ медиа","title":"Что нового в Webpack 5","description":"Улучшена скорость сборки благодаря кэшированию на диске служебных данных между разными сборками (Persistent Caching). Было проделано много работы для улучшения tree-shaking. В новой версии Webpack использует статический анализ для построения графа зависимостей, благодаря чему удаляется больше неиспользуемого кода. Также Webpack благодаря статическому анализу определяет модули без сайд-эффектов и не включает их в бандл, если они не используются. Был улучшен tree-shaking CommonJS-модулей. Было упрощено использование ассетов. Теперь не нужно устанавливать дополнительные загрузчики, например, file-loader, url-loader, raw-loader. Сергей Мелюков в феврале публиковал статью про ассеты в Webpack 5, рекомендую почитать. С пятой версии стала доступна ещё одна новая фича — Module Federation. Благодаря ей приложение может прозрачно заимствовать код из других приложений. Это позволяет делать интересные вещи, например, разделить одно большое SPA на несколько небольших. Это SPA с точки зрения пользователя будет работать как одно целое, но может разрабатываться и деплоиться разными командами независимо друг от друга. Улучшена совместимость с Web-платформой: добавлена поддержка Top Level Await, JSON Modules, WASM Modules, import.meta. Четвёртая версия Webpack могла генерировать код сборки только в стандарте в ES5. С пятой версии код сборки может генерироваться в стандарте ES2015.","url":"https://avatars.mds.yandex.net/get-images-cbir/4034731/XfZa5WDOTdv0y56r6q6zZw3831/ocr","urlToImage":"https://avatars.mds.yandex.net/get-images-cbir/4034731/XfZa5WDOTdv0y56r6q6zZw3831/ocr","publishedAt":""},{"id":5,"author":"Варужан Саргсян","title":"Что нового во Vue 3?","description":"Как будет осуществляться миграция и что будет с Vue 2? Планируется один финальный релиз версии, куда будут бэкпортирование совместимые функции Vue 3 и добавлено предупреждения об устаревании для критических изменений. Эта версия будет доступна как LTS в течение 18 месяцев, что означает, что она всё ещё будет получать обновления безопасности и её можно будет спокойно использовать дальше. Команда Vue 3 также выпустит руководства по миграции и сборку совместимости. Кроме этого, будет доступен инструмент для миграции из командной строки, который поможет вам выполнить автоматический переход с подсказками в тех местах, где обновление возможно выполнить только вручную.","url":"https://geckodynamics.com/static/vue2-vs-vue3-3f80ddd557178894ae1b1da794f85ec9.png","urlToImage":"https://geckodynamics.com/static/vue2-vs-vue3-3f80ddd557178894ae1b1da794f85ec9.png","publishedAt":"07.04.2021, 19:29"},{"id":9,"author":"aFv","title":"AFv","description":"sdfv","url":"afv","urlToImage":"afdv","publishedAt":"2021-04-25"}]}